package com.mavp.testapp;

import java.util.ArrayList;
import java.util.List;

public class CreateAlbumList {
    public static List<Album> CreateAlbumList(){
        List<Album> albumList = new ArrayList<>();

        Album album = new Album("افسانه چشم هایت", 11,"همایون شجریان، علیرضا قربانی و مهیار علیزاده" ,R.drawable.album1,"آلبوم افسانه چشمهایت اثر مشترک همایون شجریان و علیرضا قربانی پس از انتظاری نسبتا طولانی بالاخره منتشر شد. اولین خبرها از تولید این آلبوم به مردادماه سال 93 بر میگردد. اکنون پس از پنج سال این وعده تحقق یافته است. این مجموعه شامل یازده آهنگ باکلام در سبک موسیقی کلاسیک ایرانی است و آهنگسازی آن بر عهده مهیار علیزاده بوده است. بخشی از این قطعات بر روی اشعاری از نیما یوشیج تالیف شده و بخش دیگر نیز بر روی سرودههایی از شاعران معاصر از جمله احمد شاملو، محمدرضا شفیعی کدکنی، هوشنگ ابتهاج، مهدی اخوان ثالث، سیمین بهبهانی و علیرضا کلیایی. امید است که این دو خواننده پرطرفدار با اثر جدیدشان نظر مخاطبان خود را بیش از پیش جلب نمایند. این آلبوم را میتوانید اکنون از بیپ تونز به صورت قانونی دانلود کنید.");
        albumList.add(album);

        album = new Album("ابراهیم", 6,"محسن چاوشی" ,R.drawable.album2,"آلبوم جدید محسن چاوشی به نام ابراهیم در بیپ تونز منتشر شد. پس از پخش موفقیت آمیز امیر بیگزند در سال ۹۵، مخاطبان این هنرمند در انتظار پخش آلبوم جدید او ماندند. این آلبوم که ابراهیم نام گرفت با فراز و نشیبهای بسیاری روبرو شد تا جایی که گمان میرفت مجوز آلبوم صادر نشده و پخش آلبوم به صورت غیر مجاز صورت گیرد. اما نهایتا مجوزهای لازمه صادر شد و پخش رسمی آلبوم در ایران انجام شد. هیچکدام از قطعات آلبوم قبلا به صورت تکآهنگ وارد بازار نشده که این مسئله خود بر جذابیت آلبوم افزود. با توجه به گرایشی که چاووشی در آلبوم قبلی خود به موسیقی راک نشان داده بود، این احتمال وجود دارد که شاهد قطعات بیشتری از این هنرمند در فضای موسیقی راک و پاپراک باشیم. دانلود آلبوم ابراهیم از سایت بیپتونز برای مخاطبان فراهم گشته است. ");
        albumList.add(album);

        album = new Album("کجا باید برم", 13,"روزبه بمانی" ,R.drawable.album3,"آلبوم کجا باید برم اولین آلبوم رسمی روزبه بمانی است. او پیش از این قطعاتی از این آلبوم مثل «من حافظم» و «خسته شدم» را به صورت تکآهنگ منتشر کرده بود. این مجموعه شامل سیزده آهنگ باکلام در سبک پاپ است و علاوه بر خوانندگی، ترانهسرایی اثر هم بر عهده خود روزبه بمانی بوده است. از نوازندگان این آلبوم میتوان به احسان نیزن، فرشید ادهمی، مهرداد عالمی، فیروز ویسانلو، هومن نامداری، فاضل پیش و ابراهیم علوی اشاره کرد. ");
        albumList.add(album);

        album = new Album("زندگی کن", 14,"رضا صادقی" ,R.drawable.album4,"آلبوم جدید رضا صادقی زندگی کن نام دارد. زندگی کن چهارده آهنگ شنیدنی دارد. به غیر از خود رضا صادقی وحید پویان، میلاد بابایی، بابک بابایی، مجتبی ابوالقاسم پور، انوش بنارویی و معین راهبر آهنگسازان کار بودهاند. آهنگ زندگی کن یعنی اولین آهنگ یک ترانه نسبتا اجتماعی دارد و آهنگی انگیزشی است. در ادامه کارهای عاشقانه و پر احساسی به سبک خود صادقی میشنویم. گویش هرمزگانی فراموش نشده و به سنت آلبومهای قبلی یک آهنگ بندری به اسم جوک دهاتی میشنویم. رضا صادقی در آخرین روزهای سال نود و هفت هدیه خوبی به طرفداران پرشمارش داد. بشنوید و لذت ببرید.");
        albumList.add(album);

        album = new Album("سی سالگی", 11,"احسان خواجه امیری" ,R.drawable.album5,"«احسان خواجه امیری» بی شک از موفق ترین خواننده های کشورمان است. فرزند استاد «حسین خواجه امیری» اکنون از «سی سالگی» می گوید. خواجه امیری قطعه «سی سالگی» را به همسر و فرزندش تقدیم کرده و ویدیویی جالب تهیه کرده که «فرید ناصری» کارگردانی آن را بر عهده داشته است. ترانه این اثر را «روزبه بمانی» , ملودی اش را «علیرضا افکاری» و تنظیم آن را نیز «هومن نامداری» انجام داده است. پیش از این آلبوم های «پاییز، تنهایی»، «عاشقانه ها»، «یه خاطره از فردا»، «بچه های خیابونی»، «برای اولین بار»، «سلام آخر» و «فصل تازه» از این هنرمند منتشر شده بود.");
        albumList.add(album);

        album = new Album("سنتوری",8 ,"محسن چاوشی" ,R.drawable.album6,"آلبوم سنتوری نقطه عطفی در فعالیت هنری محسن چاوشی به شمار می رود. سنتوری نام فیلم سینمایی است ساخته داریوش مهرجویی که بهرام رادان و گلشیفته فراهانی در آن به ایفای نقش پرداختهاند. محسن چاوشی در ادامه مسیر هنری خود تغییرات زیادی در سبک آهنگسازی و انتخاب مضامین خود برای اشعار داشته است. مقایسه آلبومهایی مثل امیر بی گزند و من خود آن سیزدهم به خوبی نشانگر این موضوع است. اما آلبوم سنتوری همچنان از آثاری است که با گذشت سالهای زیاد مخاطبان به آن علاقه نشان میدهند. محسن چاوشی از خوانندههای موفق سالهای اخیر به شمار میرود و در کنار رضا صادقی، فریدون آسرایی، محسن یگانه، فرزاد فرزین، سعید شهروز، سیروان خسروی، علی لهراسبی، محمد علیزاده، مازیار فلاحی، شهرام شکوهی، گروه سون، بنیامین بهادری، بهنام بانی، بابک جهانبخش، حمید عسکری و مرتضی پاشایی بدنه اصلی موسیقی پاپ را تشکیل داده اند.");
        albumList.add(album);

        album = new Album("دریا",7 ,"مسیح عدل پرور و آرش عدل پرور" ,R.drawable.album7,"آلبوم دریا اولین آلبوم مسیح عدل پرور و آرش عدل پرور است. مسیح و آرش محبوبیت فوق العاده ای به واسطه تک آهنگ های موفقشان به دست آورد اند و بلاخره آلبوم دریا را روانه بازار موسیقی کشور کردند. تنظیم، میکس و مسترینگ کار با مسعود جهانی بوده و ترانه و ملودی ها از مسیح و آرش. البته آصف آریا و منصور فرهادیان ترانه و ملودی دو آهنگ را خلق کرده اند. در موسیقی مسیح و آرش فضای الکترونیک غالب است و فضای بعضی از کار کمی به سمت موسیقی هیپ هاپ می رود و به نظر می رسد یکی از دلایل موفقیتشان همین موضوع باشد. آلبوم جدید مسیح و آرش آلبومی است که در تعطیلات نوروز برای طرفداران این سبک بهترین هدیه محسوب میشود. از شنیدنش لذت ببرید.");
        albumList.add(album);

        album = new Album("نگاه من",13 ,"محسن یگانه" ,R.drawable.album8,"چهارمین آلبوم رسمی محسن یگانه، «نگاه من» نام دارد. مانند آلبومهای قبلی این هنرمند ترانه سرایی و آهنگسازی تمام قطعات این آلبوم را خود «محسن یگانه»برعهده دارد. آلبومهای حباب، رگ خواب و نفس  های بی هدف نیز از محسن یگانه منتشر شده است. محسن یگانه از خواننده های موفق سالهای اخیر به شمار می رود. در کنار محسن چاوشی، فریدون آسرایی، فرزاد فرزین، سعید شهروز، سیروان خسروی، علی لهراسبی، محمد علیزاده، گروه سون، بنیامین بهادری، بابک جهانبخش، بهنام بانی، حمید عسکری و مرتضی پاشایی بدنه اصلی موسیقی پاپ را تشکیل داده اند.");
        albumList.add(album);

        album = new Album("شش",12 ,"فرزاد فرزین" ,R.drawable.album9,"آلبوم «6» جدیدترین اثر خواننده مطرح پاپ کشورمان «فرزاد فرزین» می باشد. «فرزاد فرزین» درباره این اثر می گوید: یک سال و نیم روی این آلبوم انرژی صرف شده تا بهترین اثر ممکن با استانداردهای بالا تهیه و تولید شود. اصولاً همیشه در تولید آثارم، محتوا و کیفیت اثر برایم اولویتی مهم و حیاتی است. اعتقاد دارم این کار، آلبومی یک دست و مشخصاً با کیفیتی شده است که طرفداران «فرزاد فرزین» را خوشحال خواهد کرد. «فرزاد فرزین» پیش از این پنج آلبوم به نامهای «شراره»، «شوک»، «شانس»، «شلیک» و «شخصی» را به صورت رسمی راهی بازار موسیقی کشور کرده است. فرزاد فرزین از خواننده های موفق سالهای اخیر به شمار می رود. در کنار محسن چاوشی، فریدون آسرایی، سعید شهروز، سیروان خسروی، مازیار فلاحی، شهرام شکوهی، گروه سون، بنیامین بهادری، بابک جهانبخش، حمید عسکری و مرتضی پاشایی بدنه اصلی موسیقی پاپ را تشکیل داده اند.");
        albumList.add(album);

        album = new Album("ایران من",11 ,"همایون شجریان و سهراب پورناظری" ,R.drawable.album10,"ایران من آلبوم جدید همایون شجریان با آهنگسازی سهراب پورناظری است. آلبوم  امشب کنار غزلهای من بخواب آخرین اثری است که همایون شجریان پیش از این منتشر کرده بود. آلبوم ایران من شامل دوازده قطعه آواز و تصنیف است و در آن از سروده های شاعران کهن و معاصر مثل فردوسی، سعدی، خواجه شمس الدین محمد، اسحاق انور، پوریا سوری و اهورا ایمان بهره گرفته شده است. گفتنی است در این آلبوم علاوه بر نوازندگان متبحر ایرانی، تعدادی نوازنده خارجی نیز حضور دارند و بخش هایی از ضبط این پروژه در خارج ایران انجام شده است. در این اثر دل نیا آرام بعنوان خواننده سوپرانو حضور داشته و از نوازندگان آن می توان به تهمورس پورناظری، آزاد میرزاپور، حسین رضایی نیا، آتنا اشتیاقی، استفانی بیبو، سارا چازین و گابریل بیستلین اشاره کرد.");
        albumList.add(album);

        album = new Album("حالا که می روی",8 ,"محمد معتمدی" ,R.drawable.album11,"آلبوم حالا که میروی جدیدترین اثر خواننده شناخته شده موسیقی کشورمان، محمد معتمدی است. او پیش از این آلبوم مناجات را روانه بازار کرده بود. مجموعه حاضر شامل هشت قطعه باکلام است که آهنگسازی آنها بر عهده فرید سعادتمند بوده است. متن ترانه ها از اشعار محمدمهدی سیار انتخاب شدهاند. از نوازندگان این آلبوم میتوان به میثم مروستی، علیرضا دریایی، آتنا اشتیاقی، پوررنگ پورشیرازی و رضا تاجبخش اشاره کرد. ");
        albumList.add(album);

        return albumList ;

    }
}
